//Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
/*double Exponentiation(double a, double b)
{
double c = Math.Pow(a,b);
return c;
}
Console.Write("Введите число: ");
int a1 =Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число: ");
int b1 =Convert.ToInt32(Console.ReadLine());
Console.Write($"Ответ: {Exponentiation(a1,b1)}");
*/
