//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

/*Console.Write("Ведите трехзначное число: ");
int num = Convert.ToInt32(Console.ReadLine());

if (num >=100 && num < 1000)
{
    int LastDigit = num /10 %10;
    Console.WriteLine($"Вторая цифра трехзначного числа это {num} is {LastDigit}");
}
else 
    Console.WriteLine("Некорректное число");
*/

