// Задача 19 Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/* Console.Write("Введите число: ");
string? num=Console.ReadLine();
void CheckingNumber(string num)
{
    if (num[0]==num[4] && num[1]==num[3])   
    {
         Console.Write($"Ваше число: {num} - палиндром.");
    }
    else Console.Write($"Ваше число: {num} - не палиндром.");
}
if (num!.Length==5)
{
    CheckingNumber(num);
}
else Console.Write($"Введи правильное число");
*/
//Задача 21 Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

