// Задача 19 Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/* Console.Write("Введите число: ");
string? num=Console.ReadLine();
void CheckingNumber(string num)
{
    if (num[0]==num[4] && num[1]==num[3])   
    {
         Console.Write($"Ваше число: {num} - палиндром.");
    }
    else Console.Write($"Ваше число: {num} - не палиндром.");
}
if (num!.Length==5)
{
    CheckingNumber(num);
}
else Console.Write($"Введи правильное число");
*/
//Задача 21 Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
/*double Distance(double x1, double x2, double y1, double y2, double z1, double z2)
{
    double a = Math.Pow(x2-x1,2);
    double b = Math.Pow(y2-y1,2);
    double c = Math.Pow(z2-z1,2);
    double d = a+b+c;
    d =Math.Sqrt(d);
    return d;
}
Console.Write("Введите x перdой точки: ");
double number1=Convert.ToDouble(Console.ReadLine());
Console.Write("Ввидете y первой точки: ");
double number2=Convert.ToDouble(Console.ReadLine());
Console.Write ("Введите z первой точки: ");
double number3=Convert.ToDouble(Console.ReadLine());
Console.Write("Введите x второй точки: ");
double number4=Convert.ToDouble(Console.ReadLine());
Console.Write("Ввидете y второй точки: ");
double number5=Convert.ToDouble(Console.ReadLine());
Console.Write ("Введите z второй точки: ");
double number6=Convert.ToDouble(Console.ReadLine());

Console.Write(Distance(number1,number2,number3, number4, number5, number6));
*/


